tap "dail8859/notepadnext"
brew "f3"
brew "fd"
brew "ffmpeg"
brew "firefoxpwa"
brew "gh"
brew "git"
brew "node"
brew "qt"
brew "tmux"
cask "5kplayer"
cask "ableton-live-suite@11"
cask "bbedit"
cask "bettertouchtool"
cask "bino"
cask "brave-browser"
cask "capcut"
cask "carbon-copy-cloner"
cask "commander-one"
cask "cursor"
cask "daisydisk"
cask "dotnet-sdk"
cask "far2l"
cask "firefox"
cask "forklift"
cask "gitkraken"
cask "gpt4all"
cask "grandperspective"
cask "insta360-studio"
cask "itsycal"
cask "karabiner-elements"
cask "lastpass"
cask "lm-studio"
cask "lulu"
cask "macmorpheus"
cask "notepadnext"
cask "notion"
cask "path-finder"
cask "rectangle"
cask "signal"
cask "spotify"
cask "sublime-text@dev"
cask "superwhisper"
cask "textmate"
cask "touchdesigner"
cask "vlc@nightly"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-preview-github-styles"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "sourcegraph.amp"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
